# GeomCombinationSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeomCombinationSet Constructor
GeomCombinationSet Class See Also
---
Initializes a new instance of the GeomCombinationSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GeomCombinationSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
GeomCombinationSet()
```

# See Also
GeomCombinationSet Class
Autodesk.Revit.DB Namespace